update to agent rag
